#                        Sneaker Resell Market--SQL analysis
## The purpose of this work is to 1) show some insights of the sneaker resell market; 2) practice some basic and intermediate level sql queries responding some add-hoc analysis needs

### Prework: first, I'd like to use ipython-sql-magic cells to realize running sql and python code at the same time shout out to CatherineDevlin's guidance and development https://github.com/catherinedevlin/ipython-sql

In [3]:
%load_ext sql

In [4]:
%sql postgresql://postgres:714233@localhost/test

u'Connected: postgres@test'

In [7]:
%sql SELECT * FROM pg_user;
''''
use this query to find the current user of postgresql,
and the connecting string should follow "postgresql://{user}:{password}@localhost/some_database"

 * postgresql://postgres:***@localhost/test
1 rows affected.

[(u'postgres', 10, True, True, True, True, u'********', None, None)]

In [6]:
%sql select * from sneakers limit 5;
''''
this is the completed table after data cleaning and processing
in the following lines, I will redo this work

 * postgresql://postgres:***@localhost/test
5 rows affected.

[(63, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 9), 9.0, 205, 1, 160, 20.0),
 (64, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 9), 8.0, 154, 1, 160, -24.0),
 (65, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 8), 9.0, 175, 1, 160, -6.0),
 (66, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 8), 8.0, 135, 1, 160, -41.0),
 (67, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 7), 9.0, 170, 1, 160, -10.0)]

### 1.1 Create table and Import the csv

In [18]:
%sql drop table sneakers; 
# drop table because it has alreaday been created

 * postgresql://postgres:***@localhost/test
Done.

[]

In [19]:
%sql create table sneakers (id serial primary key,sneaker_name text, \
                            sales_day date,shoe_size varchar(6),price integer,retro_type text);
%sql select * from sneakers;

 * postgresql://postgres:***@localhost/test
Done.
 * postgresql://postgres:***@localhost/test
0 rows affected.

[]

In [20]:
%sql copy sneakers from 'D:\removal of study material\big data I\final project-sneaker index\data\sneaker complete list.csv' \
delimiter ',' csv header;

 # header here means ignore thr first row of the csv, cuz it is the column name

 * postgresql://postgres:***@localhost/test
133036 rows affected.

[]

### 2.1 Data Cleaning--Listwise deletion of the null records

In [21]:
%sql select * from sneakers where sneaker_name is null or sales_day is null or shoe_size is null or price is null \
or retro_type is null;

 * postgresql://postgres:***@localhost/test
21 rows affected.

[(6581, u'Jordan 10 Retro Doernbecher', None, u'11', 255, u'10'),
 (9900, u'Jordan 10 Retro Old Royal', None, u'8.5', 146, u'10'),
 (10831, u'Jordan 10 Retro Steel (2005)', None, u'9.5', 175, u'10'),
 (24179, u'Jordan 11 Retro Playoffs CDP (2008)', None, u'8', 460, u'11'),
 (33287, u'Jordan 12 Retro PSNY Wheat', None, u'8', 361, u'12'),
 (33424, u'Jordan 12 Retro Cherry (2009)', None, u'8', 299, u'12'),
 (42411, u'Jordan 13 Retro Low Quai 54', None, u'10', 285, u'13'),
 (43691, u'Jordan 13 Retro Chris Paul Home', None, u'11', 300, u'13'),
 (50625, u'Jordan 14 Retro Light Graphite (2011)', None, None, 96, u'14'),
 (58126, u'Jordan 2 Retro Iron Purple', None, u'9.5', 225, u'2'),
 (67949, u'Jordan 3 Retro Doernbecher (2010)', None, None, 600, u'3'),
 (82129, u'Jordan 4 Retro Military Blue (2006)', None, u'11', 185, u'4'),
 (82563, u'Jordan 4 Retro Fire Red Mars Blackmon', None, u'11', 195, u'4'),
 (96327, u'Jordan 5 Retro Doernbecher', None, u'9.5', 825, u'5'),
 (108798, u'Jordan 6 Retro Brazil World Cup', None, u'10.5', 225, u'6'),
 (108929, u'Jordan 6 Retro Motorsport', None, u'8.5', 400, u'6'),
 (118466, u'Jordan 7 Retro Golden Moments Pack', None, u'11', 270, u'7'),
 (122476, u'Jordan 8 Retro Cool Grey', None, u'8', 186, u'8'),
 (129102, u'Jordan 9 Retro Pinnacle Baseball Black', None, u'13', 260, u'9'),
 (131323, u'Jordan 9 Retro Powder', None, u'7.5', 220, u'9'),
 (132432, u'Jordan 9 Retro White Black Red (2010)', None, u'10.5', 325, u'9')]

In [22]:
%sql delete from sneakers where sneaker_name is null or sales_day is null or shoe_size is null or price is null \
or retro_type is null;

 * postgresql://postgres:***@localhost/test
21 rows affected.

[]

### 2.2 Data Cleaning--Eliminating the PS or GS shoes

In [25]:
%sql select distinct shoe_size as z from sneakers order by z ASC limit 10;
# we find some size following W or C, those are women shoes and baby shoes

 * postgresql://postgres:***@localhost/test
10 rows affected.

[(u'10',),
 (u'10.5',),
 (u'11',),
 (u'11.5',),
 (u'11.5C',),
 (u'11C',),
 (u'11W',),
 (u'12',),
 (u'12.5',),
 (u'12C',)]

In [26]:
%sql select count (*) from sneakers where shoe_size like '%C' or shoe_size like '%W';

 * postgresql://postgres:***@localhost/test
1 rows affected.

[(49L,)]

In [27]:
%sql delete from sneakers where shoe_size like '%C' or shoe_size like '%W';

 * postgresql://postgres:***@localhost/test
49 rows affected.

[]

In [28]:
%sql alter table sneakers alter column shoe_size type float USING shoe_size::double precision;
# after removing the W C sizes, we can modity the column nature to float

 * postgresql://postgres:***@localhost/test
Done.

[]

In [29]:
%sql delete from sneakers where shoe_size < 7;
# remove the GS size, focus on mens size

 * postgresql://postgres:***@localhost/test
801 rows affected.

[]

### 2.3 Data Cleaning--Check retro_type

In [30]:
%sql select distinct retro_type from sneakers;

 * postgresql://postgres:***@localhost/test
16 rows affected.

[(u'8',),
 (u'9',),
 (u'2',),
 (u'da',),
 (u'13',),
 (u'5',),
 (u'Hy',),
 (u'3',),
 (u'1',),
 (u'7',),
 (u'14',),
 (u'4',),
 (u'6',),
 (u'11',),
 (u'10',),
 (u'12',)]

In [31]:
%sql select *from sneakers where retro_type ='da' or retro_type ='Hy'; 
# based on the result, we need to fix 'da' to 2, and delete 'Hy' row

 * postgresql://postgres:***@localhost/test
18 rows affected.

[(133019, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 10, 16), 10.5, 140, u'da'),
 (133020, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 10, 12), 11.0, 200, u'da'),
 (133021, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 9, 28), 13.0, 150, u'da'),
 (133022, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 9, 23), 9.0, 300, u'da'),
 (133023, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 8, 31), 11.5, 275, u'da'),
 (133024, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 8, 28), 13.0, 250, u'da'),
 (133025, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 8, 11), 10.0, 250, u'da'),
 (133026, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 5, 25), 13.0, 250, u'da'),
 (133027, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 4, 21), 10.0, 300, u'da'),
 (133028, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 1, 16), 10.5, 265, u'da'),
 (133029, u'Air Jordan 2 Retro QF Black White', datetime.date(2017, 1, 9), 13.0, 250, u'da'),
 (133030, u'Air Jordan 2 Retro QF Black White', datetime.date(2016, 12, 18), 12.0, 300, u'da'),
 (133031, u'Air Jordan 2 Retro QF Black White', datetime.date(2016, 12, 16), 10.0, 250, u'da'),
 (133032, u'Air Jordan 2 Retro QF Black White', datetime.date(2016, 9, 23), 11.5, 275, u'da'),
 (133033, u'Air Jordan 2 Retro QF Black White', datetime.date(2016, 9, 18), 10.0, 265, u'da'),
 (133034, u'Air Jordan 2 Retro QF Black White', datetime.date(2016, 8, 18), 11.0, 300, u'da'),
 (133035, u'Air Jordan 2 Retro QF Black White', datetime.date(2016, 8, 12), 8.5, 300, u'da'),
 (133036, u'Jordan Hyper Violet', datetime.date(2016, 10, 30), 7.5, 175, u'Hy')]

In [33]:
%sql delete from sneakers where retro_type ='Hy';
%sql  update sneakers set retro_type='2' where  retro_type='da';

 * postgresql://postgres:***@localhost/test
1 rows affected.
 * postgresql://postgres:***@localhost/test
17 rows affected.

[]

In [34]:
%sql alter table sneakers alter column retro_type type integer USING retro_type::integer;
# after removing the strange value, we could convert some data type of column

 * postgresql://postgres:***@localhost/test
Done.

[]

### 2.4 Date Cleaning--Working on the prcie range and Detect outliners
#### Based on the diff price range, we get the insight that almost 90% transactions are coming from price $100-499

In [48]:
%sql select sum (case when price between 0 and 99 then 1 else 0 end) as steal, \
 ROUND(100.0 * sum (case when price between 0 and 99 then 1 else 0 end)/COUNT(id),1) as stealper,\
sum (case when price between 100 and 199 then 1 else 0 end) as economic,\
 ROUND(100.0 * sum (case when price between 100 and 199 then 1 else 0 end)/COUNT(id),1) as ecoper, \
sum (case when price between 200 and 299 then 1 else 0 end) as brick,\
 ROUND(100.0 * sum (case when price between 200 and 299 then 1 else 0 end)/COUNT(id),1) as brickper, \
sum (case when price between 300 and 399 then 1 else 0 end) as profit,\
ROUND(100.0 * sum (case when price between 300 and 399 then 1 else 0 end)/COUNT(id),1) as profitper, \
sum (case when price between 400 and 499 then 1 else 0 end) as hype, \
 ROUND(100.0 * sum (case when price between 400 and 499 then 1 else 0 end)/COUNT(id),1) as hypeper, \
sum (case when price between 500 and 599 then 1 else 0 end) as lux, \
 ROUND(100.0 * sum (case when price between 500 and 599 then 1 else 0 end)/COUNT(id),1) as luxper, \
sum (case when price between 600 and 40000 then 1 else 0 end) as super, \
 ROUND(100.0 * sum (case when price between 600 and 40000 then 1 else 0 end)/COUNT(id),1) as superper from sneakers;

 * postgresql://postgres:***@localhost/test
1 rows affected.

[(787L, Decimal('0.6'), 30471L, Decimal('23.1'), 48355L, Decimal('36.6'), 25683L, Decimal('19.4'), 11313L, Decimal('8.6'), 6504L, Decimal('4.9'), 9051L, Decimal('6.8'))]

In [54]:
%sql drop table snkr;
%sql create table snkr as select * from sneakers where price between 100 and 499;

 * postgresql://postgres:***@localhost/test
Done.
 * postgresql://postgres:***@localhost/test
115822 rows affected.

[]

In [55]:
%sql select * from snkr limit 10;

 * postgresql://postgres:***@localhost/test
10 rows affected.

[(1, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 17), 10.5, 154, 1),
 (2, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 17), 11.0, 145, 1),
 (3, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 17), 10.5, 200, 1),
 (4, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 17), 8.0, 154, 1),
 (5, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 16), 10.5, 140, 1),
 (6, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 16), 8.5, 130, 1),
 (7, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 16), 12.0, 139, 1),
 (8, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 16), 8.0, 135, 1),
 (9, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 16), 11.0, 140, 1),
 (10, u'Jordan 1 Retro High OG Sail', datetime.date(2017, 10, 16), 8.5, 135, 1)]